Tekla Open API Reference for Tekla Structures 2025
BooleanPart Properties
The BooleanPart type exposes the following members.
Properties
Name | Description
Father
 The father object of the boolean operation; the model object instance to operate on.
 (Inherited from Boolean.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
OperativePart
 The part that does the boolean operation. When Insert() is called, this field is overwritten with a new part instance which is a copy of the original operative part. This part has the same identifier as the boolean part. Modifications (such as profile change) have to be made through the part instance and not the boolean part instance. The operative part's class must be BooleanOperativeClass.
Type
 Defines the boolean operation: an add or a cut.
Top
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace